# Datos del Titanic

In [110]:
import seaborn as sns

In [111]:
titanic = sns.load_dataset("titanic")

In [112]:
import numpy as np
import pandas as pd

In [113]:
titanic.head()
titanic.shape

(891, 15)

In [114]:
titanic["survived"] = pd.Categorical(titanic["survived"])

In [115]:
titanic["pclass"] = pd.Categorical(titanic["pclass"])
titanic["sex"] = pd.Categorical(titanic["sex"])
titanic["sibsp"] = pd.Categorical(titanic["sibsp"])
titanic["parch"] = pd.Categorical(titanic["parch"])
titanic["embarked"] = pd.Categorical(titanic["embarked"])
titanic["who"] = pd.Categorical(titanic["who"])
titanic["adult_male"] = pd.Categorical(titanic["adult_male"])
titanic["deck"] = pd.Categorical(titanic["deck"])
titanic["embark_town"] = pd.Categorical(titanic["embark_town"])
titanic["alive"] = pd.Categorical(titanic["alive"])
titanic["alone"] = pd.Categorical(titanic["alone"])

In [116]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [117]:
# titanic['survived'] = titanic['survived'].replace([0], 'No')
# titanic.head()

# Tablas de contingencias de una variable

In [118]:
tab = pd.crosstab(index = titanic["survived"],
                 columns = "pasajeros")
tab

col_0     pasajeros
survived
0               549
1               342

In [119]:
type(tab)

pandas.core.frame.DataFrame

In [120]:
pd.crosstab(index = titanic["pclass"],
           columns = "pasajeros")

col_0   pasajeros
pclass
1             216
2             184
3             491

In [121]:
pd.crosstab(index = titanic["sex"],
           columns = "pasajeros")

col_0   pasajeros
sex
female        314
male          577

In [122]:
tab_c = pd.crosstab(index = titanic["deck"],
           columns = "count")
tab_c

col_0  count
deck
A         15
B         47
C         59
D         33
E         32
F         13
G          4

In [123]:
tab_c.sum()

col_0
count    203
dtype: int64

In [124]:
tab_c.shape

(7, 1)

In [125]:
tab_c.iloc[0:4]

col_0  count
deck
A         15
B         47
C         59
D         33

In [126]:
tab_c/tab_c.sum()

col_0     count
deck
A      0.073892
B      0.231527
C      0.290640
D      0.162562
E      0.157635
F      0.064039
G      0.019704

In [127]:
tab_d = pd.crosstab(index = titanic["sex"],
           columns = "pasajeros")
tab_d

col_0   pasajeros
sex
female        314
male          577

In [128]:
tab_d/tab_d.sum()

col_0   pasajeros
sex
female   0.352413
male     0.647587

In [129]:
tab/tab.sum()

col_0     pasajeros
survived
0          0.616162
1          0.383838

# Tablas de contingencia de dos variables

In [130]:
survived_sex = pd.crosstab(index = titanic["survived"],
                          columns = titanic["sex"] )
survived_sex.index = ["died","survived"]
survived_sex

sex       female  male
died          81   468
survived     233   109

In [131]:
survived_class = pd.crosstab(index = titanic["survived"],
                          columns = titanic["pclass"],
                            margins=True)
survived_class.index = ["murio","sobrevivio", "total_clase"]
survived_class.columns = ["primera","segunda","tercera","total_superv"]
survived_class

             primera  segunda  tercera  total_superv
murio             80       97      372           549
sobrevivio       136       87      119           342
total_clase      216      184      491           891

# Frecuencias relativas globales

In [139]:
survived_class/survived_class.iloc[2, 3] #buscar con indice
survived_class/survived_class.loc["total_clase", "total_superv"]#buscar con label

              primera   segunda   tercera  total_superv
murio        0.089787  0.108866  0.417508      0.616162
sobrevivio   0.152637  0.097643  0.133558      0.383838
total_clase  0.242424  0.206510  0.551066      1.000000

# Frecuencias Relativas Marginales

In [147]:
survived_class/survived_class.loc["total_clase"] #por columnas

             primera   segunda   tercera  total_superv
murio        0.37037  0.527174  0.757637      0.616162
sobrevivio   0.62963  0.472826  0.242363      0.383838
total_clase  1.00000  1.000000  1.000000      1.000000

In [151]:
survived_class.div(survived_class.loc["total_clase"], axis = 1) #por columnas

             primera   segunda   tercera  total_superv
murio        0.37037  0.527174  0.757637      0.616162
sobrevivio   0.62963  0.472826  0.242363      0.383838
total_clase  1.00000  1.000000  1.000000      1.000000

In [152]:
?survived_class.div

In [148]:
survived_class.T/survived_class["total_superv"] #por filas

                 murio  sobrevivio  total_clase
primera       0.145719    0.397661     0.242424
segunda       0.176685    0.254386     0.206510
tercera       0.677596    0.347953     0.551066
total_superv  1.000000    1.000000     1.000000

In [174]:
survived_class.div(survived_class["total_superv"], axis = 0) #por filas

              primera   segunda   tercera  total_superv
murio        0.145719  0.176685  0.677596           1.0
sobrevivio   0.397661  0.254386  0.347953           1.0
total_clase  0.242424  0.206510  0.551066           1.0

# Tablas multidimensionales

In [157]:
surv_sex_class = pd.crosstab(index = titanic["survived"],
                            columns = [titanic["sex"],titanic["class"]],
                            margins = True)
surv_sex_class

sex      female               male               All
class     First Second Third First Second Third
survived
0             3      6    72    77     91   300  549
1            91     70    72    45     17    47  342
All          94     76   144   122    108   347  891

In [158]:
surv_sex_class["female"]

class     First  Second  Third
survived
0             3       6     72
1            91      70     72
All          94      76    144

In [163]:
surv_sex_class["female"]["First"]

survived
0       3
1      91
All    94
Name: First, dtype: int64

In [171]:
surv_sex_class/surv_sex_class.iloc[2, 6] #Frecuancia Relativa Global

sex         female                          male                          All
class        First    Second     Third     First    Second    Third
survived
0         0.003367  0.006734  0.080808  0.086420  0.102132  0.33670  0.616162
1         0.102132  0.078563  0.080808  0.050505  0.019080  0.05275  0.383838
All       0.105499  0.085297  0.161616  0.136925  0.121212  0.38945  1.000000

In [172]:
surv_sex_class.div(surv_sex_class.loc["All"], axis = 1) #por columnas

sex         female                      male                           All
class        First    Second Third     First    Second     Third
survived
0         0.031915  0.078947   0.5  0.631148  0.842593  0.864553  0.616162
1         0.968085  0.921053   0.5  0.368852  0.157407  0.135447  0.383838
All       1.000000  1.000000   1.0  1.000000  1.000000  1.000000  1.000000

In [189]:
surv_sex_class.div(surv_sex_class["All"], axis = 0) #por filas

sex         female                          male                      All
class        First    Second     Third     First    Second     Third
survived
0         0.005464  0.010929  0.131148  0.140255  0.165756  0.546448  1.0
1         0.266082  0.204678  0.210526  0.131579  0.049708  0.137427  1.0
All       0.105499  0.085297  0.161616  0.136925  0.121212  0.389450  1.0